auth/app/models/user.rb

  def self.authenticate(username, password)
    user = User.find_by(username: username)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "alan"], ["LIMIT", 1]]